  /*
    Завдання:
     Копіювати текст із файлу RegExp.txt на сайт https://regexr.com/
     Написати регулярний вираз, який знайде:
       1. Усі слова.
       2. Усі збіги букв від a до e,
       3. Року, наприклад 2004
       4. Слова загорнуті в [квадратні Кавички]
       5. Усі формати файлів .jpg / .png / .gif
       6. Усі email com.ua
       7. Всі слова написані з великої літери
       8. Знайти телефон написаний за патерном +00 (000) 000-00-00,
          де замість 0 може бути будь-яке число
  */
// 1
var allWords = /\w+/g;

// 2
var someWords = /[a-e]/g;

// 3
var years = /[0-9]/g;

// 4
var squareWords = /\[\w+\]/g;

// 5
var file = /\.gif/g;

// 6
var email = /(\b\w*)@(\w+\.\w+\b)/;

// 7
var bigLetter = /([A-Z])\w+/g; 

// 8
var phone = /(?:\+|\d)[\d\-\(\) ]{9,}\d/;
